var _html = (element, arr) => {
  var ul = document.querySelector(element);
  for (var elem of arr) {
    ul.innerHTML += `<li><a target="_blank" href="${elem[0]}">${elem[1]}</a></li>`;
  }
}
(() => {
  var arr = [
    ["/aiqingxianhua/", "爱情鲜花"],
    ["/youqingxianhua/", "友情鲜花"],
    ["/theme/birthday/", "生日鲜花"],
    ["/songzhangbeixianhua/", "问候长辈"],
    ["/zhufuqinghexianhua/", "祝贺鲜花"],
    ["/hunqingxianhua/", "婚庆鲜花"],
    ["/tanbingweiwenxianhua/", "探病慰问"],
    ["/daoqianxianhua/", "道歉鲜花"],
    ["/businessFlower/kaiyehualan/", "开业花篮"]
  ];
  _html(".dropdown-menu>ul.list-inline:nth-child(2)", arr);
})();
(() => {
  var arr = [
    ["/yongshenghua/yongshenghua_box.html", "经典花盒"],
    ["/yongshenghua/yongshenghua_large.html", "巨型玫瑰"],
    ["/yongshenghua/yongshenghua_lavender.html", "薰衣草"]
  ];
  _html(".dropdown-menu>ul.list-inline:nth-child(4)", arr);
})();
(() => {
  var arr = [
    ["/", "首页"],
    ["/flower/", "鲜花"],
    ["/yongshenghua/", "永生花"],
    ["/huayu/", "花语大全"]
  ];
  _html("nav .nav", arr);
})();
(() => {
  var media = document.querySelector(".container .center-list1");
  var arr = [
    ["23005", "2018年世界电子商务大会在京召开，花礼网荣获电子商务最具品牌价值奖", "2018-12-28"],
    ["22454", "互联网已经进入下半场，鲜花电商该何去何从？", "2018-09-07"],
    ["19691", "2017世界电子商务大会在京举行，花礼网荣获最具影响力奖", "2017-11-06"],
    ["17809", "花礼网被授予中国电子商务行业联盟副理事长单位", "2017-03-06"],
    ["17656", "花礼网荣获中国电子商务行业门户大会鲜花礼品行业龙头奖", "2016-12-08"],
    ["17639", "百易（花礼网）获2016年国家级高新技术企业认定", "2016-11-30"],
    ["17533", '花礼网与"不要音乐"合作打造国内大型音乐旅行节目', "2016-10-26"],
    ["17190", "教师节临近鲜花走俏 康乃馨仍然最抢手", "2016-09-01"],
    ["16165", "花礼网携手陌陌礼物商城推出鲜花即时送", "2016-06-05"],
    ["15419", "花礼网微电影《勇敢爱》倾情巨献", "2016-04-13"],
    ["13828", "花礼网发布2015中国浪漫城市排行榜，北深高居前两位", "2015-12-24"],
    ["12611", "花礼网携手科大讯飞引领移动订花新革命", "2015-09-24"],
    ["12545", "花礼网荣获2015年鲜花礼品行业龙头奖", "2015-09-09"],
    ["11922", "鲜花市场剑拔弩张 电商纷纷另辟蹊径", "2015-02-12"],
    ["11283", "中国鲜花礼品网获评“鲜花礼品电商龙头企业”", "2014-01-06"],
    ["11270", "“花示爱体”蹿红网络，网友争相表白", "2013-12-19"],
    ["11098", "正规订花网站如何防止假冒“情感受损”?", "2013-08-27"],
    ["11193", "京东上线JD.com，盘点中国电商短域名", "2013-04-17"],
    ["10579", "张杰深圳演唱会温情落幕 歌迷鲜花求婚感动全场", "2012-12-25"],
    ["10529", "2012中国网上零售年会：中国鲜花礼品网获最佳用户体验奖", "2012-11-28"],
    ["10474", "盘点前十中国鲜花速递网站，看行业发展", "2012-11-02"],
    ["10456", "鲜花速递行业搭第三方支付快车 加速破冰进程", "2012-10-26"],
    ["10417", "中国鲜花礼品网：幸福快车 全年无休", "2012-10-12"],
    ["10372", "中国鲜花礼品网创意洋溢，创意产品花样百出", "2012-08-31"],
    ["10367", "鲜花速递渐成气候，选择可靠的鲜花网站是关键", "2012-08-15"],
    ["10358", "鲜花网“天价”购入域名hua.com，风险还是机会？", "2012-08-06"],
    ["10357", "启用hua.com域名,中国鲜花礼品网新战略", "2012-07-25"],
    ["10356", "中国鲜花礼品网悄然启用hua.com新域名", "2012-07-25"],
    ["10355", "这个情人节 让我们过得更诗情画意", "2010-02-08"],
    ["10352", "“2009消费者喜爱网站TOP100”榜单揭晓", "2009-11-20"],
    ["10351", "“百佳品牌购物网站”十强 老将新秀齐争锋", "2009-10-10"],
    ["10350", "网上办年货今春新时尚", "2009-07-31"],
    ["10345", "支付宝发布鲜花行业新接口", "2007-05-31"],
    ["10341", "双节搅热鲜花市场 红玫瑰价格一日翻番", "2007-01-29"],
    ["10340", "“心愿之旅”特别行动", "2006-12-27"],
  ];
  for (var elem of arr) {
    media.innerHTML += `<li><a href="/profile/${elem[0]}.html" target="_blank">${elem[1]}</a><span>${elem[2]}</span></li>`;
  }
})();
(() => {
  var bd = document.querySelector(".pull-left .bd");
  var arr = [
      ["news.htm", "公司动态"],
      ["media.html", "媒体报道"],
      ["culture.htm", "企业文化"],
      ["/productpj/", "客户体验"],
      ["gdsj.html", "感动瞬间"],
      ["/XianHuaShiPai/", "订单实拍秀"],
      ["why_choose_us.htm", "为什么选择我们"],
      ["contact.htm", "联系我们"]
  ];
  var i = 1;
  for (var elem of arr) {
      bd.innerHTML += `<li><a href="${elem[0]}"><span class="ico ico-about${i}"></span>${elem[1]}</a></li>`;
      i++;
  }
})();


