var _html = (element, arr) => {
    var ul = document.querySelector(element);
    for (var elem of arr) {
        ul.innerHTML += `<li><a target="_blank" href="${elem[0]}">${elem[1]}</a></li>`;
    }
}
(() => {
    var arr = [
        ["/aiqingxianhua/", "爱情鲜花"],
        ["/youqingxianhua/", "友情鲜花"],
        ["/shengriliwu/", "生日鲜花"],
        ["/songzhangbeixianhua/", "问候长辈"],
        ["/zhufuqinghexianhua/", "祝贺鲜花"],
        ["/hunqingxianhua/", "婚庆鲜花"],
        ["/tanbingweiwenxianhua/", "探病慰问"],
        ["/daoqianxianhua/", "道歉鲜花"],
        ["/businessFlower/kaiyehualan/", "开业花篮"]
    ];
    _html(".dropdown-menu>ul.list-inline:nth-child(2)", arr);
})();
(() => {
    var arr = [
        ["/yongshenghua/yongshenghua_box.html", "经典花盒"],
        ["/yongshenghua/yongshenghua_large.html", "巨型玫瑰"],
        ["/yongshenghua/yongshenghua_lavender.html", "薰衣草"]
    ];
    _html(".dropdown-menu>ul.list-inline:nth-child(4)", arr);
})();
(() => {
    var arr = [
        ["/", "首页"],
        ["/flower/", "鲜花"],
        ["/yongshenghua/", "永生花"],
        ["/huayu/", "花语大全"]
    ];
    _html("nav .nav", arr);
})();
(() => {
    var news = document.querySelector(".container .center-list1");
    var arr = [
        ["22973", "花礼网品牌升级，更换全新品牌LOGO", "2018-11-21"],
        ["22769", "秋季主题花束，看了好舒适好惬意！", "2018-10-18"],
        ["22449", "教师节中秋节定制鲜花，美得灼瞎双眼！", "2018-09-07"],
        ["21915", "花礼网hua.com正式入驻大新时代大厦，恭贺乔迁之喜！", "2018-06-26"],
        ["21695", "520告白礼，10大表白鲜花礼物推荐，大声说爱你！", "2018-05-16"],
        ["21292", "花礼网高端鲜花“设计师臻选”栏目全新上线！", "2018-04-02"],
        ["20955", "3.8女人节新品温情无限，一束送妈，一束送她！辛苦啦~", "2018-03-06"],
        ["20625", "花礼网2018情人节新品上架，冬季请深陷爱情！", "2018-01-31"],
        ["19999", "【新品上架】火爆ins的熊抱花束来啦~快给她一个大大的熊抱吧！", "2017-12-05"],
        ["19806", "“心连心，携手再出发”花礼网珠三角花店培训交流会圆满结束", "2017-11-20"],
        ["19728", "花礼网鲜花现身热播网剧《王牌总裁霸王花》", "2017-11-09"],
        ["19694", "花礼网荣获2017世界电子商务大会最具影响力奖", "2017-11-06"],
        ["19271", "【新品花篮+月饼礼盒】国庆中秋，将爱带回家！", "2017-09-27"],
        ["18691", "七夕鲜花新品，总有一款俘获你心！", "2017-08-22"],
        ["18288", "荷兰可利鲜公司驻中国代表郭艳春女士莅临hua.com花礼网举办讲座", "2017-07-18"],
        ["18217", "专属父亲的定制花礼｜2017年父亲节鲜花、永生新品推荐", "2017-06-22"],
        ["18163", "花礼网携手新浪百万鲜花致敬全城母亲", "2017-05-15"],
        ["17950", "母亲节永生花新品|想将最好的都送赠妳", "2017-04-17"],
        ["17811", "3.8女人节，送给女人的永生花新品！", "2017-03-07"],
        ["17808", "3.8女人节，最佳鲜花礼品推荐！", "2017-03-06"],
        ["17761", "2017春季鲜花新品，给春天增添新色彩！", "2017-02-17"],
        ["17760", "2017情人节新品永生花系列上线，让爱情长久保鲜!", "2017-02-07"],
        ["17736", "百度深圳分公司总经理张作诚莅临hua.com花礼网参观指导", "2017-01-08"],
        ["17735", "花礼网绿植全新上线，让绿植走进生活！", "2016-12-30"],
        ["17640", "花礼网2016圣诞节新品出炉啦~选礼物不要错过这里！", "2016-11-30"],
        ["17600", "上海新湘会成员莅临深圳总部花礼网参观指导", "2016-11-18"],
        ["17526", "10月永生花新品限量版上架秋冬请深陷爱情", "2016-10-19"],
        ["17450", "“花礼网”与“不要音乐”联袂合作打造大型音乐旅行节目", "2016-09-22"],
        ["17205", "花礼网内部员工花艺培训，共同演绎花艺精彩", "2016-09-05"],
        ["17154", "花礼网教师节新品上线，不凋谢的永生花现低价购买！", "2016-08-31"],
        ["16501", "两大B2C电商强强联合：花礼网“七夕节鲜花”专场入驻唯品会", "2016-07-18"],
        ["16350", "《勇敢爱》专题全新上线，让我们一起勇敢爱！", "2016-07-03"],
        ["16305", "这样送花才洋气，花礼网（hua.com）最新高档鲜花礼盒隆重上线！", "2016-06-22"],
        ["16072", "520“勇敢爱”活动已圆满结束，3名获奖者“爱情故事”太感人！", "2016-05-27"],
        ["15941", "花礼网重磅推出520表白新品，创意爆表！", "2016-05-17"],
        ["15577", "春暖花开好时节，春季新品大赏", "2016-04-21"],
        ["15418", "从未见过如此可爱的花店，看看小花家的H5", "2016-04-13"],
        ["15069", "花礼网APP全新改版，好评不断！", "2016-03-17"],
        ["14938", "赶快来玩，花礼游乐园开放啦！", "2016-03-08"],
        ["14604", "HUA.com礼品卡全新上市", "2016-02-18"],
        ["14551", "花礼网微电影《勇敢爱》倾情巨献", "2016-02-15"],
        ["14213", "逢节必惠，招行携手花礼网屡推活动专题", "2016-01-20"],
        ["14156", "大片风范，花礼网推出情境体验式广告", "2016-01-15"],
        ["12543", "花礼网获“2015年鲜花礼品行业龙头奖”殊荣", "2015-09-09"],
        ["11888", "中国鲜花礼品网正式启用简称品牌“花礼网”", "2015-01-29"],
        ["11277", "HUA.com获评“中国互联网电子商务鲜花礼品行业龙头企业”", "2013-12-22"],
        ["11212", "“HUA示爱体”风靡网络", "2013-12-19"],
        ["11053", "中国鲜花礼品网“手机版”全新上线", "2013-08-06"],
        ["10872", "2013（B2B）电商经理人年会指定鲜花服务商", "2013-05-07"],
        ["10862", "情系雅安，感谢您参与爱心义卖活动", "2013-04-28"],
        ["10843", "情系雅安，中国鲜花礼品网捐款10万元，启动爱心义卖活动", "2013-04-22"],
        ["10853", "我司荣获“中国互联网电子商务诚信示范企业”称号", "2013-03-06"],
        ["10701", "史上最全对比/选择鲜花网站攻略", "2013-02-11"],
        ["10681", "2013年春节假期照常营业，客服工作时间调整通知", "2013-02-04"],
        ["10555", "新浪微博上线启动“关注见面礼”活动", "2012-12-10"],
        ["10522", "第七届中国网上零售年会指定鲜花服务商", "2012-11-26"],
        ["10530", "2012年度中国网上零售年会最佳用户体验奖", "2012-11-26"],
        ["10495", "中国鲜花礼品网助阵“张杰2012首个个人生日演唱会”", "2012-11-13"],
        ["news_20120319", "中国鲜花礼品网正式启用hua.com为主域名(原域名FlowerCN.com)", "2012-07-16"],
        ["news_20120113", "春节假期照常营业，客服工作时间调整通知", "2012-01-12"],
        ["news_20111110", "中国鲜花礼品网入选2011年度消费者最喜爱的网站TOP100", "2011-11-10"],
        ["news_20110423", "“第六届中小企业电子商务应用发展大会”指定鲜花服务商", "2011-04-23"],
        ["news_20110201", "中国鲜花礼品网-2011年情人节订购服务声明", "2011-02-01"],
        ["news_20100127", "春节假期照常营业，客服工作时间调整通知", "2011-01-27"],
        ["news_20101210", "中国鲜花礼品网入选2010中国网上零售诚信品牌100强", "2010-12-10"],
        ["news_20100901", "国庆假期照常营业，客服工作时间调整通知", "2010-09-30"],
        ["news_20100501", "中国鲜花礼品网荣获APEC“2010中国电子商务e价值榜‘金种子’奖”", "2010-05-22"],
        ["news_20100102", "中国鲜花礼品网-2010年情人节/春节鲜花订购服务声明", "2010-02-01"],
        ["news_20100101", "中国鲜花礼品网--礼品卡专区开通啦", "2010-01-01"],
        ["news_20091101", "中国鲜花礼品网荣获“2009年消费者最喜爱的网站TOP100”称号", "2009-11-21"],
        ["news_20090901", "中国鲜花礼品网荣获“百佳品牌购物网站”称号", "2009-09-29"],
        ["news_20090801", "新品上市：泰国保鲜花-FIORA鲜花花瓶！", "2009-08-07"],
        ["news_20090701", "深圳一品轩蛋糕上线订购啦！", "2009-07-01"],
        ["news_20090402", "乔迁新址通知", "2009-04-26"],
        ["news_20090401", "“第四届中国中小企业电子商务应用发展大会”指定鲜花服务商", "2009-04-19"],
        ["news_20090102", "中国鲜花礼品网-2009年情人节鲜花订购服务声明", "2009-01-10"],
        ["news_20090101", "中国鲜花礼品网-2009年春节鲜花礼品配送的通知", "2009-01-04"],
        ["news_20081101", "中国鲜花礼品网-本公司专用短信号码的特别提醒", "2008-11-17"],
        ["news_20080701", "中国鲜花礼品网-众志成城，抗震救灾（续）", "2008-07-08"],
        ["news_20080502", "中国鲜花礼品网-众志成城，抗震救灾", "2008-05-14"],
        ["news_20080501", "中国鲜花礼品网-2008年母亲节鲜花订购服务声明", "2008-05-01"],
        ["news_20080302", "“第三届中小企业电子商务应用发展大会”指定鲜花服务商", "2008-03-25"],
        ["news_20080101", "中国鲜花礼品网-2008年春节鲜花礼品配送的通知", "2008-01-31"],
        ["news_20071202", "中国鲜花礼品网-财付通年度优惠活动！", "2007-12-25"],
        ["news_20071201", "中国鲜花礼品网-品牌公仔频道正式上线啦！", "2007-12-01"],
        ["news_20071101", '中国鲜花礼品网荣获“2007年消费者最喜爱的网站TOP100”称号，并同时获得"最佳服务奖"单项大奖', "2007-11-30"],
        ["news_20061201", "中国鲜花礼品网荣获“2006消费者最喜爱的网站TOP100”称号", "2006-12-20"],
        ["news_20061001", "会员充值返现活动", "2006-10-09"]
    ];
    for (var elem of arr) {
        news.innerHTML += `<li><a href="/profile/${elem[0]}.html" target="_blank">${elem[1]}</a><span>${elem[2]}</span></li>`;
    }
})();
(() => {
    var bd = document.querySelector(".pull-left .bd");
    var arr = [
        ["news.htm", "公司动态"],
        ["media.html", "媒体报道"],
        ["culture.htm", "企业文化"],
        ["/productpj/", "客户体验"],
        ["gdsj.html", "感动瞬间"],
        ["/XianHuaShiPai/", "订单实拍秀"],
        ["why_choose_us.htm", "为什么选择我们"],
        ["contact.htm", "联系我们"]
    ];
    var i = 1;
    for (var elem of arr) {
        bd.innerHTML += `<li><a href="${elem[0]}"><span class="ico ico-about${i}"></span>${elem[1]}</a></li>`;
        i++;
    }
})();

