(() => {
  new Vue({
    el: ".grid-wrapper",
    data: {
      item: [
        [9012332, "留住好时光", "239", "留住好时光-粉绣球1枝，粉雪山玫瑰6枝", "精选昆明A级花材"],
        [9012339, "抱抱我/自然风抱桶花", "158", "抱抱我/自然风抱桶花-向日葵1枝，红玫瑰2枝，红色多头玫瑰2枝", "抱抱桶新款"],
        [9010766, "圆满", "280", "圆满-粉百合2枝、红玫瑰9枝、红色康乃馨15枝", "花篮设计 送礼百搭"],
        [9012334, "幸福满溢", "239", "幸福满溢-多头百合2枝，卡罗拉玫瑰8枝，红太阳花6枝", "畅销节日花篮"],
        [9012410, "感恩有你", "339", "感恩有你-紫红康乃馨10枝，苏醒玫瑰10枝，蓝色绣球1枝", "静谧优雅 落落大方"],
        [9012054, "真诚祝愿", "288", "真诚祝愿-花篮", ""],
        [9020012, "水果花篮-欣情", "348", "水果花篮-欣情-百合、红掌、玫瑰、扶郎、康乃馨等花材；进口橙子、红富士苹果、红提、哈密瓜等新鲜水果", ""],
        [9012315, "妈妈我爱你", "429", "妈妈我爱你-粉色康乃馨、粉绣球、香槟玫瑰、洋牡丹、黄色香雪兰", "清新淡雅 笑容常伴"],
        [9012413, "春风十里", "429", "春风十里-粉佳人玫瑰10枝，粉色洋牡丹10枝，粉色绣球1枝", "暖春新品"],
        [9010765, "欣欣向荣", "279", "欣欣向荣-红掌、多头粉香水百合、红太阳花、康乃馨等花材", ""],
        [9010871, "好想你", "136", "好想你-红色康乃馨12枝，白色相思梅2枝，栀子叶0.5扎", ""],
        [9020015, "水果花篮-温馨祝福", "279", "水果花篮-温馨祝福-粉香水百合1枝,粉玫瑰8枝", ""],
        [9010875, "因为爱", "245", "因为爱-粉色康乃馨12枝，紫色桔梗3枝，粉色香水百合2枝", ""],
        [9012047, "爱的思念", "226", "爱的思念-手提式花篮", ""],
        [9020011, "水果花篮-欣喜", "298", "水果花篮-欣喜-百合,向日葵、玫瑰、扶郎、康乃馨等花材，橙子、苹果、进口红提", ""],
        [9010811, "阳光心情", "329", "阳光心情-10枝多头黄百合", ""],
        [9012337, "静若繁花", "288", "静若繁花-紫色绣球1枝，魅影或冷美人玫瑰11枝", ""],
        [9020014, "永不褪色的爱", "379", "永不褪色的爱-红玫瑰、多头红玫瑰、尤加利叶、红掌、小天使等花材；长城解百纳", ""],
        [9010734, "清风雅韵", "169", "清风雅韵-香槟玫瑰12枝，迷你菊6枝", ""],
        [9012412, "盛情满满", "369", "盛情满满-红康乃馨10枝，红玫瑰10枝，红色洋牡丹10枝", "花成蜜就"],
        [9020017, "苏醒的温柔", "339", "苏醒的温柔-苏醒玫瑰、白百合、银叶菊、粉色多头康乃馨；火龙果、香蕉、苹果", ""]
      ]
    }
  });
})();
(() => {
  new Vue({
    el: ".wrapper :last-child :last-child .panel-body",
    data: {
      side: [
        [9012009, "313889*", "还行。很满意"],
        [9010966, "hua_133*", "按时送到老人特高兴 其次客服婷婷服务特别周到，耐心谢谢"],
        [9012223, "136****3714", "很不错，喜欢"],
        [9010969, "wxmp_hl*", "女朋友很喜歡呢"],
        [9010011, "159****1663", "客服、服务都可以"],
        [9012033, "309679*", "花很新鲜、漂亮，朋友很喜欢，派送时间很准"]
      ]
    }
  });
})();
(() => {
  new Vue({
    el: ".knowledge",
    data: {
      one: [
        ["/huayu/11406.html", "看病人送什么花？"],
        ["/huayu/10492.html", "给病人送花送什么好？"],
        ["/huayu/20050613222928.htm", "玫瑰.百合等鲜花的保鲜"],
        ["/huayu/12242.html", "鲜花怎么保鲜？鲜花保鲜方法有哪些？"],
        ["/huayu/20051115103923.htm", "鲜花寓意 浪漫花语"]
      ],
      two: [
        ["/huayu/10458.html", "探望病人送什么花？最温馨的花款推荐"],
        ["/huayu/10457.html", "看望病人送什么花好？"],
        ["/huayu/20051115103610.htm", "鲜花枝数寓意"],
        ["/huayu/20051115105306.htm", "送花的常识和技巧"],
        ["/huayu/20051116174222.htm", "经典送花祝福语"]
      ],
      three: [
        ["/huayu/20050422170012.htm", "如何让鲜花保鲜"],
        ["/huayu/20050611130941.htm", "鲜花与节日"],
        ["/huayu/20050611131024.htm", "鲜花与生日"],
        ["/huayu/20050611130752.htm", "鲜花与场合"],
        ["/huayu/20050405004253.htm", "女孩都喜欢别人送鲜花吗？"]
      ]
    }
  });
})();

























