var _html = (element, arr) => {
    var ul = document.querySelector(element);
    for (var elem of arr) {
        ul.innerHTML += `<li><a target="_blank" href="${elem[0]}">${elem[1]}</a></li>`;
    }
}
(() => {
    var arr = [
        ["aiqingxianhua", "爱情鲜花"],
        ["shengriliwu", "生日鲜花"],
        ["youqingxianhua", "友情鲜花"],
        ["songzhangbeixianhua", "问候长辈"],
        ["tanbingweiwenxianhua", "探病慰问"],
        ["daoqianxianhua", "道歉鲜花"],
        ["zhufuqinghexianhua", "祝贺鲜花"],
        ["hunqingxianhua", "婚庆鲜花"],
        ["businessFlower", "商务鲜花"]
    ];
    _html(".dropdown-menu>ul.list-inline:nth-child(2)", arr);
})();
(() => {
    var arr = [
        ["box", "经典花盒"],
        ["large", "巨型玫瑰"],
        ["lavender", "薰衣草"],
        ["vase", "永生瓶花"],
        ["characteristic", "特色永生花"]
    ];
    _html(".dropdown-menu>ul.list-inline:nth-child(4)", arr);
})();
(() => {
    var arr = [
        ["livingflower/", "泰国保鲜花"],
        ["gifts/musicbox/", "音乐盒"],
        ["gifts/crystallaser/", "水晶内雕"],
        ["gifts/goldenflower/", "金箔花"],
        ["gifts/cosmeticmirror/", "化妆镜"],
        ["gifts/kingking/", "香薰系列"],
        ["gifts/bestlife/", "音乐睡枕"],
        ["gifts/vase/", "花瓶/相框"],
        ["katonghuashu/", "卡通花束"],
        ["toys/", "品牌公仔"],
        ["gifts/shoushi/", "首饰"],
        ["gifts/giftstalk/", "Giftstalk精选"],
        ["gifts/dengshi/", "创意礼品"],
        ["qiyetuangou/gift_card.html", "礼品卡"],
        ["gifts/duorouzhiwupenzai/", "多肉植物盆栽"]
    ];
    _html(".dropdown-menu>ul.list-inline:nth-child(6)", arr);
})();
(() => {
    var arr = [
        ["greenplant/", "绿色植物"],
        ["potflower/", "盆栽花卉"]
    ];
    _html(".dropdown-menu>ul.list-inline:nth-child(8)", arr);
})();
(() => {
    var arr = [
        ["/", "首页"],
        ["/flower", "鲜花"],
        ["/yongshenghua", "永生花"],
        ["/cake", "蛋糕"],
        ["/gifts", "礼品"],
        ["/gifts/chocolates", "巧克力"],
        ["/huayu", "花语大全"],
        ["/you", "设计师臻选鲜花"],
        ["/theme/chongyangjie", "重阳节鲜花礼品"],
    ];
    _html("nav .nav", arr);
})();
(() => {
    var arr = [
        [
            [10973, "为什么要选择鲜花速递？"],
            [10976, "选择鲜花速递需要注意什么？"],
            [20051115103610, "送花支数代表的含义"],
            [20051115103923, "各种花代表的不同含义"],
            [20051116172128, "玫瑰概述及花语"]
        ],
        [
            [20051115103610, "送花的常识和技巧"],
            [20051116174222, "经典送花祝福语"],
            [20050612082846, "用鲜花表达情感-谈送花礼仪"],
            [20050611130752, "不同场合送什么花？"],
            [20050611130659, "鲜花与星座"]
        ],
        [
            [20050422170012, "如何让鲜花保鲜"],
            [20050611130941, "鲜花与节日"],
            [20050611131024, "鲜花与生日"],
            [20050612080530, "婚礼用鲜花大全"],
            [20050405004253, "女孩都喜欢别人送鲜花吗？"]
        ]
    ];
    var str = "";
    for (var elems of arr) {
        str += "<ul>";
        for (var elem of elems) {
            str += `<li><a href="/huayu/${elem[0]}.html" target="_blank">${elem[1]}</a></li>`
        }
        str += "</ul>";
    }
    liyi.innerHTML = str;
})();
(() => {
    var list=document.querySelector(".product-list ul");
    var arr = [
        ["1073263", "创意永生花台灯，可调亮度", "永生花/永生花满月艺术台灯/朦胧粉", "永生花台灯", 398],
        ["1073247", "上市即卖断货的爆款重上架", "永生花/花好月圆永生花台灯", "精选进口奥斯汀永生玫瑰台灯", 298],
        ["1073186", "全新升级款带化妆镜", "经典花盒/我如此爱你-口红款520", "Dior#520口红(专柜正品)＋进口永生玫瑰礼盒", 588],
        ["1073264", "创意新品 永生花礼盒", "永生花/一鹿(路)有你永生花小夜灯", "永生花礼盒", 298],
        ["1060030", "", "泰国保鲜花/美丽无限/三色玫瑰", "", 298],
        ["1073244", "永生花+台灯+蓝牙音箱", "永生花/永生花带灯+蓝牙音箱/浪漫粉", "看得到的美好，听得到的浪漫！", 398],
        ["1070076", "KT授权正版", "永生花/HelloKitty公主的花园永生花礼盒", "Hello Kitty凯蒂猫进口永生花礼盒", 298],
        ["1073120", "专业定制款复古相框", "永生花/时光的花", "复古相框 ,进口粉色玫瑰2枝 ,进口紫色玫瑰1枝", 368],
        ["1073209", "", "永生花/花漾蜜恋&#183;少女粉", "音乐球永生花礼盒，创意礼物", 298],
        ["1073181", "泰迪珍藏限量首发", "永生花/「泰迪珍藏」泰迪熊永生花公仔/红", "Teddy Bear Collection泰迪珍藏授权正版", 298],
        ["1073033", "爆款特惠！", "永生花/一生一世", "厄瓜多尔进口永生红玫1朵，双色永生绣球", 198],
        ["1060022", "", "泰国保鲜花/斜口瓶花", "真空保鲜花，彩玫系列，5年不凋谢", 489],
        ["1073255", "新款上市！施华洛世奇项链", "永生花/花漾年华-施华洛世奇项链", "施华洛世奇项链", 1299],
        ["1060010", "", "泰国保鲜花/优雅", "真空玫瑰，彩玫七枝，5年不凋谢", 548],
        ["1060002", "畅销榜特惠，泰国进口", "泰国保鲜花/我爱你", "不凋谢的玫瑰 红玫瑰系列 最佳送女友礼物", 228],
        ["1073137", "韵升专业定制音乐盒底座", "巨型玫瑰/公主的音乐水晶球&#183;红玫瑰", "大型水晶音乐球永生花", 398],
        ["1073100", "畅销款特惠", "巨型玫瑰/彩虹下的约定/花的嫁纱银项链", "厄瓜多尔进口巨型彩色玫瑰+T400花的嫁纱S925银项链", 368],
        ["1073094", "", "特色永生花/To温暖你心", "苔藓小兔+粉色永生玫瑰＋粉边紫心奥斯丁", 288],
        ["1073254", "新款上市！迪奥香水礼盒", "永生花/花漾年华-迪奥香水款50ml", "Miss Dior花漾淡香氛50ml", 999],
        ["1073206", "", "永生花/Hello Kitty怦然心动永生花相框／黑色", "创意情人节礼物", 298],
        ["1073151", "", "永生花/小仙女/永生花首饰盒", "日本进口粉紫色大地永生玫瑰，奥斯丁永生玫瑰，搭配绣球等花材", 368],
        ["1073140", "", "永生花/迷你兔&#183;红", "苔藓小兔1只、进口红色永生玫瑰1朵、樱花粉小玫瑰1朵", 188],
        ["1070064", "", "永生花/天使之恋化妆镜永生花礼盒", "化妆镜+永生玫瑰，送恋人妻子专属奢华系列礼盒", 368],
        ["1073092", "", "特色永生花/恋心", "蓝色永生玫瑰＋紫色永生玫瑰", 288],
        ["1073221", "寓意：5201314", "永生花/「倾情系列」5201314/红", "正品YSL圣罗兰/迪奥口红套装＋进口永生玫瑰礼盒", 1314],
        ["1073187", "进口香氛永生花特别定制款", "永生花/我如此爱你-香氛款", "进口Voluspa香氛＋进口永生玫瑰，带化妆镜", 388],
        ["1073155", "", "永生花/Be My Love", " 厄瓜多尔进口红色永生玫瑰2枝，进口白色永生玫瑰1枝，棉花2朵，粉色珍珠5颗", 398],
        ["1060038", "", "泰国保鲜花/一路上有你/三色玫瑰", "5年不凋谢，真空保鲜花，彩玫系列，玫瑰5枝", 359],
        ["1073197", "", "永生花/「倾世之爱」我心永恒", "大型心型永生花盒", 520],
        ["1073239", "畅销星月耳钉礼盒款", "永生花/我如此爱你-Glam Ever星月耳钉款", "星星月亮不对称玫瑰金耳钉＋永生花盒", 388],
        ["1073213", "轻奢款，犹如炫美月光宝盒", "永生花/「月光宝盒」浪漫小夜曲", "永生红玫瑰瓶花", 999],
        ["1073172", "", "永生花/心跳", "厄瓜多尔进口永生红玫2朵、红色小玫瑰3朵、灰色冰淇淋装饰5个、手工小狗1对", 699],
        ["1073171", "", "永生花/Honey ", "厄瓜多尔进口永生粉玫2朵、进口白色永生玫瑰2朵、棉花3朵、粉色手工小狗1个", 699],
        ["1073249", "创意设计LED小夜灯", "永生花/HelloKitty神奇小夜灯", "永生花LED小夜灯", 398],
        ["1073200", "", "永生花/芭比粉", "心形永生花礼盒", 398],
        ["1073199", "", "永生花/水晶之恋", "心形永生花礼盒", 398],
        ["1073111", "手工永生花制作", "永生花/静谧时光", "进口深紫色玫瑰1枝，进口紫色玫瑰1枝，进口奥斯丁1枝，苔藓小兔1只", 398],
        ["1073159", "豪华定制款礼盒,限量发售", "永生花/「倾世之爱」梦幻花园", "厄瓜多尔进口粉色永生玫瑰", 1999],
        ["1070061", "", "永生花/限量奢华爱情玫瑰化妆镜永生花礼盒", "化妆镜+永生玫瑰", 588],
        ["1060009", "", "泰国保鲜花/幸福时光", "爱情保鲜花，红玫瑰系列，5年不凋谢", 569],
        ["1073038", "", "特色永生花/想念的季节", "厄瓜多尔粉玫瑰1朵", 198],
        ["1073207", "独具特色的心形设计", "永生花/Hello Kitty怦然心动永生花相框／紫色", "创意情人节礼物", 298],
        ["1073157", "奢华定制60cm巨型礼盒,限量发售", "永生花/「倾世之爱」奢宠", "厄瓜多尔进口红色永生玫瑰", 2999],
        ["1060005", "", "泰国保鲜花/玫瑰恋曲", "玫瑰保鲜花，红玫瑰系列，泰国进口", 468],
        ["1073248", "创意设计香薰机+加湿器", "永生花/Hellokitty永生花香薰机加湿器", "永生玫瑰香薰机加湿器", 339],
        ["1060028", "", "泰国保鲜花/真爱玫瑰", "精选绽放优美的红玫瑰5枝", 459],
        ["1060037", "", "泰国保鲜花/一生所爱", "进口保鲜花，三色玫瑰系列，5年不凋谢", 228],
        ["1073101", "", "巨型玫瑰/粉色琉璃", "厄瓜多尔进口巨型粉玫瑰+T400花的嫁纱S925银项链", 338],
        ["1073258", "独创设计，双口红心形礼盒", "永生花/守护初心口红款礼盒/少女粉", "迪奥口红两支：Dior#520、Dior#999口红(专柜正品)＋进口永生玫瑰礼盒", 999],
        ["1073242", "永生花+台灯+蓝牙音箱", "永生花/永生花带灯+蓝牙音箱/玫瑰红", "创意新品，看得到的美好，听得到的浪漫！", 398],
        ["1073212", "轻奢款，特大号双开礼盒", "永生花/「月光宝盒」心动邂逅", "永生粉玫瑰瓶花", 999],
        ["1060011", "", "泰国保鲜花/美丽人生", "进口高档保鲜花,白玫瑰系列,生日礼物首选", 469],
        ["1073253", "新上市！配首饰或迪奥香水", "永生花/花漾年华-迪奥香水款30ml", "Miss Dior花漾淡香氛", 799],
        ["1073129", "专业定制款，复古相框", "永生花/温柔清浅", "进口粉色玫瑰2枝，进口浅紫色康乃馨3枝，粉边紫心奥斯丁2枝", 366],
        ["1073210", "", "永生花/花漾蜜恋&#183;淡雅紫", "音乐球永生花礼盒，创意礼物", 298],
        ["1073231", "口红#SRD04-空姐色", "永生花/只对你动心-美宝莲星钻小灯管空姐色", "正品美宝莲口红＋进口永生玫瑰礼盒", 368],
        ["1073176", "送女性定制 升级款化妆镜", "永生花/幸运之吻-香氛款", "厄瓜多尔进口永生红色康乃馨1朵、进口永生红玫1朵、红色小玫瑰2朵", 388],
        ["1073170", "淡雅、如沐春天般的感觉", "永生花/如沐暖风", "厄瓜多尔进口永生粉玫2朵、进口白色蔷薇2朵、海星2个、进口粉色康乃馨3朵", 398],
        ["1073166", "豪华定制款皮盒,限量发售", "永生花/「倾世之爱」爱的告白", "进口粉紫色永生玫瑰65朵、白色永生玫瑰30朵", 5200],
        ["1073164", "", "永生花/Sweet Dream", "进口樱花粉奥斯丁永生玫瑰2朵，进口紫色永生玫瑰1朵，进口粉紫色永生玫瑰1朵", 328],
        ["1073243", "永生花+台灯+蓝牙音箱", "永生花/永生花带灯+蓝牙音箱/天空蓝", "看得到的美好，听得到的浪漫！", 398],
        ["1073158", "奢华定制款", "永生花/「倾世之爱」永生玫瑰熊/定制款/60CM", "奢华定制，进口永生玫瑰熊", 19999],
        ["1073109", "", "巨型玫瑰/小熊的花园", "苔藓小熊1个，墨绿色进口巨型玫瑰1枝，浅粉桃色玫瑰1枝", 899],
        ["1073174", "", "永生花/柔情时光-口红款999", "厄瓜多尔进口永生粉玫1朵、粉色小玫瑰2朵、进口紫色康乃馨1朵", 588],
        ["1073039", "送母亲长辈热销", "特色永生花/爱与祝福", "紫心奥斯汀玫瑰1朵，进口粉色康乃馨1枝，浅粉桃色小玫瑰2朵", 198],
        ["1073125", "", "永生花/公主的水晶鞋&#183;粉", "进口粉色永生玫瑰1枝，小玫瑰1枝，搭配粉色白色绣球、小满天星", 198],
        ["1073136", "", "巨型玫瑰/公主的音乐水晶球&#183;七彩", "大型水晶音乐球永生花", 469],
        ["1073240", "大热斩男水红色", "永生花/给你我的心-美宝莲星钻小灯管水红色", "正品美宝莲口红＋进口永生玫瑰礼盒", 368],
        ["1073230", "Chili/小辣椒明星色", "永生花/只对你动心-M.A.C小辣椒口红", "正品M.A.C子弹头口红＋进口永生玫瑰礼盒", 496],
        ["1073182", "泰迪珍藏限量首发", "永生花/「泰迪珍藏」泰迪熊永生花公仔", "Teddy Bear Collection泰迪珍藏授权正版", 298],
        ["1073175", "珍珠项链/珍珠耳钉可选", "永生花/柔情时光－耳钉款", "厄瓜多尔进口永生粉玫1朵、粉色小玫瑰2朵、进口紫色康乃馨1朵", 469],
        ["1073179", "珍珠项链/珍珠耳钉可选", "永生花/幸运之吻－珍珠耳钉款", "厄瓜多尔进口永生红玫1朵、红色小玫瑰2朵、进口红色康乃馨1朵", 469],
        ["1073195", "特别定制款、畅销款", "永生花/特别的想念-项链款", "T400唯爱S925银锁骨项链＋永生花盒", 388],
        ["1073112", "热销款", "永生花/小公主", "进口永生玫瑰＋唯爱S925银锁骨项链", 489],
        ["1070054", "妈妈/女性专属,限量特价", "永生花/女人花化妆镜永生花套装", "温馨康乃馨永生花化妆镜套装礼盒", 298],
        ["1073173", "升级款化妆镜", "永生花/柔情时光－香氛款", "厄瓜多尔进口永生粉玫1朵、粉色小玫瑰2朵、进口紫色康乃馨1朵", 388],
        ["1073191", "", "经典花盒/特别的想念-口红款999", "正品Dior999口红＋进口永生玫瑰礼盒", 588],
        ["1060063", "", "泰国保鲜花/心若兰", "万紫千红系列进口泰国保鲜花，5年不凋谢", 238],
        ["1073121", "送礼、家居及办公室装饰", "永生花/印象&#183;初夏", "进口米白色玫瑰1枝，桃粉色玫瑰1枝，奥斯丁玫瑰2枝，浅粉桃色小玫瑰3枝", 338],
        ["1073178", "珍珠项链/珍珠耳钉可选", "永生花/幸运之吻－珍珠项链款", "厄瓜多尔进口永生红玫1朵、红色小玫瑰2朵、进口红色康乃馨1朵", 469],
        ["1073180", "", "永生花/柔情时光－珍珠项链款", "厄瓜多尔进口永生粉玫1朵、粉色小玫瑰2朵、进口紫色康乃馨1朵", 469],
        ["1060051", "泰国进口，特大号", "泰国保鲜花/玫瑰花园/淡雅", "进口保鲜花，彩玫系列，清新优雅,生日礼品,家居礼物", 786],
        ["1073147", "德国工艺 见证永恒爱情", "永生花/海洋之恋", "厄瓜多尔进口蓝色永生玫瑰5朵，白玫瑰5朵,浅蓝色奥斯丁4朵", 999],
        ["1073108", "", "永生花/森情蜜语", "苔藓小熊1个，厄瓜多尔进口红色永生玫瑰1枝，进口白色奥斯汀玫瑰1朵，浅粉色小玫瑰2朵", 288],
        ["1073146", "", "永生花/一见倾心", "粉色厄瓜多尔进口永生玫瑰5枝，紫色进口玫瑰4枝，粉紫色奥斯丁玫瑰4枝", 1314],
        ["1073222", "寓意：5201314", "永生花/「倾情系列」5201314/粉", "正品YSL圣罗兰/迪奥口红套装＋进口永生玫瑰礼盒", 1314],
        ["1073190", "全新升级款带化妆镜", "经典花盒/特别的想念-口红款YSL", "正品YSL圣罗兰方管口红＋进口永生玫瑰礼盒", 588],
        ["1073160", "", "永生花/萌动初心", "厄瓜多尔进口粉色永生玫瑰", 269],
        ["1073017", "", "永生花/一生的承诺", "厄瓜多尔玫瑰进口整枝大号永生玫瑰", 298],
        ["1073123", "送母亲长辈、家居摆设", "永生花/温情守候", "进口红色永生玫瑰2枝，小红玫瑰1枝，酒红色康乃馨1枝，棉花1枝", 298],
        ["1073126", "", "永生花/公主的水晶鞋&#183;蓝", "进口蓝色永生玫瑰1枝，康乃馨1枝，搭配小玫瑰，蓝色白色绣球、小满天星", 198],
        ["1073003", "", "经典花盒/触摸/薰衣草礼盒", "薰衣草礼盒：进口薰衣草永生花", 168],
        ["1073233", "Chili/小辣椒明星色", "永生花/给你我的心-M.A.C小辣椒口红", "正品M.A.C口红＋进口永生玫瑰礼盒", 496],
        ["1073034", "", "永生花/快乐熊", "苔藓小熊1只，绿色奥斯丁玫瑰，浅粉桃色小玫瑰", 198],
        ["1073139", "", "巨型玫瑰/公主的音乐水晶球&#183;粉玫瑰", "大型水晶音乐球永生花", 398],
        ["1060043", "", "泰国保鲜花/约定", "高身方口花瓶进口保鲜花，彩玫系列,不凋谢玫瑰", 489],
        ["1073241", "大热斩男水红色", "永生花/只对你动心-美宝莲星钻小灯管水红色", "正品美宝莲口红＋进口永生玫瑰礼盒", 368],
        ["1060026", "", "泰国保鲜花/心心相恋", "真空玫瑰，红玫瑰系列，5年不凋", 429],
        ["1060007", "", "泰国保鲜花/五彩生活", "不凋谢玫瑰，彩玫系列，进口保鲜花 ", 308],
        ["1073183", "泰迪珍藏限量首发", "永生花/「泰迪珍藏」泰迪熊永生花公仔", "Teddy Bear Collection泰迪珍藏授权正版", 298],
        ["1060045", "", "泰国保鲜花/天使的爱", "荷兰工艺保鲜玫瑰，白/彩玫瑰共3朵，泰国进口", 218],
        ["1060001", "", "泰国保鲜花/爱是唯一", "不凋谢的鲜花 红玫瑰系列 进口保鲜花", 158],
        ["1073202", "", "永生花/爱如繁星", "白色满天星1把、粉色满天星适量、紫色满天星适量", 139],
        ["1070063", "永生花浪漫奢华礼盒", "永生花/Hello Kitty水晶化妆镜永生花礼盒", "化妆镜+永生玫瑰，送恋人妻子专属奢华系列礼盒", 388],
        ["1070062", "送长辈老师定制款", "永生花/女人花化妆镜永生花礼盒", "化妆镜+永生玫瑰，送妈妈及长辈专属奢华系列礼盒", 368],
        ["1073119", "", "永生花/星辰", "进口永生蓝玫瑰9枝，搭配香芋紫绣球", 689],
        ["1073093", "", "特色永生花/倾尽所爱", "苔藓小熊＋厄瓜多尔进口红玫＋香槟色奥斯丁玫瑰＋浅粉桃色小玫瑰", 288],
        ["1073113", "", "永生花/花开半夏", "粉色进口永生玫瑰，搭配永生香芋紫绣球", 689],
        ["1073145", "", "永生花/一吻之间", "厄瓜多尔进口红色永生玫瑰9枝，苔藓熊1只", 999],
        ["1073057", "", "巨型玫瑰/经典七彩", "七彩永生玫瑰:厄瓜多尔进口巨型玫瑰", 298],
        ["1073114", "", "永生花/深海秘境", "进口永生蓝玫瑰6枝，浅粉桃色玫瑰3枝", 468],
        ["1073025", "升级款", "经典花盒/怦然心动", "永生花盒：厄瓜多尔进口红色永生玫瑰", 689],
        ["1073153", "", "永生花/挚爱", "苔藓小熊1个，厄瓜多尔进口红色永生玫瑰2枝，进口白色奥斯汀玫瑰1朵，红色小玫瑰2朵", 356],
        ["1073059", "", "巨型玫瑰/十二星座经典粉&#183;双子座", "粉色永生玫瑰:厄瓜多尔进口巨型玫瑰", 268],
        ["1073204", "专业定制水晶音乐盒底座", "永生花/守护的爱", "大型水晶音乐球永生花", 388],
        ["1073196", "定制新品", "永生花/「倾世之爱」真心爱你", "心型永生花盒", 469],
        ["1073232", "口红#SRD04-空姐色", "永生花/给你我的心-美宝莲星钻小灯管空姐色", "正品美宝莲口红＋进口永生玫瑰礼盒", 368],
        ["1073110", "", "永生花/爱的归属", "苔藓小熊1个，进口橘色玫瑰1枝，进口奥斯丁2枝，浅粉桃小玫瑰1枝", 398],
        ["1073156", "七彩玫瑰+施华洛世奇元素", "巨型玫瑰/彩虹下的约定/玻璃鞋手链", "厄瓜多尔进口巨型七彩玫瑰+施华洛世奇元素水晶手链", 378],
        ["1073131", "", "永生花/甜蜜恋情", "厄瓜多尔进口永生红玫瑰（直径6-7cm）3枝，红色小玫瑰3枝", 358],
        ["1073068", "", "巨型玫瑰/经典红", "红色永生玫瑰:厄瓜多尔进口巨型玫瑰", 268],
        ["1073015", "", "巨型玫瑰/柔粉", "粉色永生玫瑰,厄瓜多尔进口巨型玫瑰", 268],
        ["1073073", "", "巨型玫瑰/十二星座经典蓝&#183;双子座", "蓝色永生玫瑰:厄瓜多尔进口巨型玫瑰", 238],
        ["1073088", "", "巨型玫瑰/十二星座经典红&#183;双子座", "红色永生玫瑰:厄瓜多尔进口巨型玫瑰", 268],
        ["1073237", "", "永生花/我如此爱你-Glam Ever手镯款", "单钻吊坠手镯＋永生花盒", 599],
        ["1073117", "", "永生花/维也纳深林", "苔藓小熊1个，厄瓜多尔进口永生白色玫瑰2枝", 328],
        ["1073205", "", "永生花/最美的期待", "大型水晶音乐球永生花", 388],
        ["1073130", "", "永生花/爱的礼物", "进口深紫色玫瑰1枝，进口豆沙粉色康乃馨3枝，进口香槟色奥斯丁玫瑰2枝，", 398],
        ["1073245", "", "永生花/璀璨星辰-浪漫紫", "浅紫满天星0.3扎，粉色、紫色勿忘我各5枝", 79],
        ["1073168", "", "巨型玫瑰/公主的音乐水晶球&#183;蓝玫瑰", "大型水晶音乐球永生花", 398],
        ["1073081", "12个星座可选", "巨型玫瑰/十二星座经典红&#183;金牛座", "红色永生玫瑰:厄瓜多尔进口巨型玫瑰", 268],
        ["1073103", "特惠", "经典花盒/兔子小姐", "永生花盒：厄瓜多尔进口白玫瑰1朵，黄边绿心奥斯丁玫瑰2朵", 298],
        ["1073128", "送母亲/长辈精选", "特色永生花/幸福港湾", "进口粉色玫瑰1枝，浅紫色康乃馨1枝，浅粉桃色小玫瑰1朵", 288],
        ["1073040", "十二星座可选", "巨型玫瑰/十二星座经典七彩&#183;双子座", "彩虹永生玫瑰：厄瓜多尔进口巨型玫瑰", 298],
        ["1060064", "", "泰国保鲜花/邂逅", "万紫千红系列进口泰国保鲜花，5年不凋谢", 469],
        ["1073135", "", "永生花/光阴的故事", "进口橘色永生玫瑰2枝，绿色奥斯丁玫瑰1枝", 298],
        ["1073211", "", "永生花/花漾蜜恋&#183;轻柔蓝", "音乐球永生花礼盒，创意礼物", 298],
        ["1073024", "", "经典花盒/漫步爱琴海", "永生花盒：厄瓜多尔进口蓝色永生玫瑰3枝", 326],
        ["1073014", "", "巨型玫瑰/黛绿", "绿色永生玫瑰:厄瓜多尔进口巨型玫瑰", 268],
        ["1073118", "", "永生花/永恒的约定", "红色进口永生玫瑰6枝，红色小玫瑰3枝", 466],
        ["1073250", "KT创意设计 手工制作", "永生花/HelloKitty一心一意-蓝牙音箱", "永生花蓝牙音箱+小夜灯", 429],
        ["1073023", "", "经典花盒/佳期如梦", "永生花盒：进口永生玫瑰3枝,永生康乃馨3枝", 436],
        ["1073116", "", "永生花/维多利亚花园", "苔藓小熊1个，进口永生橘色玫瑰2枝，香槟色奥斯丁玫瑰1枝", 329],
        ["1060006", "", "泰国保鲜花/纯心纯意", "保鲜玫瑰花，彩玫系列", 398],
        ["1073217", "", "永生花/璀璨星辰", "白色满天星1把、紫色勿忘我1把", 79],
        ["1073102", "", "经典花盒/最相思", "永生花盒：厄瓜多尔进口白玫瑰1朵，黄边紫心奥斯丁3朵", 298],
        ["1060003", "", "泰国保鲜花/爱永恒", "进口保鲜花，彩玫系列，5年不凋谢", 258],
        ["1073192", "5.20专属定制款", "经典花盒/特别的想念-口红款520", "正品Dior#520口红＋进口永生玫瑰礼盒", 588],
        ["1073246", "", "永生花/璀璨星辰-少女粉", "粉色满天星0.3扎，白色、粉色勿忘我各5枝", 89],
        ["1073169", "", "永生花/温暖的港湾/粉色", " 进口粉色永生玫瑰1枝、浅紫色康乃馨1枝，浅粉桃色小玫瑰1朵", 198],
        ["1073104", "", "经典花盒/小清新", "永生花盒：厄瓜多尔进口白玫瑰2朵，绿色奥斯丁2朵", 358],
        ["1073177", "送妈妈、女性专属定制", "永生花/幸运之吻-口红款YSL", "正品YSL圣罗兰方管口红＋进口永生玫瑰礼盒", 588],
        ["1073185", "Dior、YSL口红可选", "经典花盒/我如此爱你-口红款999", "专柜正品Dior#999口红＋进口永生玫瑰礼盒", 588],
        ["1073251", "迪奥香水礼盒", "永生花/我如此爱你-迪奥香水款50ml", "Miss Dior花漾淡香氛50ml", 999],
        ["1073252", "迪奥香水礼盒", "永生花/我如此爱你-迪奥香水款30ml", "Miss Dior花漾淡香氛30ml", 799],
        ["1073257", "独创设计，双口红心形礼盒", "永生花/守护初心口红款礼盒/炽热红", "迪奥口红两支：Dior#520、Dior#999口红(专柜正品)＋进口永生玫瑰礼盒", 999],
        ["1073260", "创意新品 永生花化妆镜盒", "永生花/独家记忆", "永生花化妆镜礼盒", 368],
        ["1073259", "创意新品 永生花化妆镜盒", "永生花/神秘花园", "永生花化妆镜礼盒", 368]
    ];
    for (var elem of arr) {
        list.innerHTML += `
        <li>
            <a href="/product/${elem[0]}.html" target="_blank" data-link="${elem[0]}">
                <div class="item-img">
                    <img data-original="../newpic/${elem[0]}.jpg_220x240.jpg" src="../newpic/${elem[0]}.jpg_220x240.jpg">
                </div>
                <div class="product-info">
                    <p class="promotion">${elem[1]}&nbsp;</p>
                    <h5 class="name" style="overflow: hidden; height: 20px; line-height: 20px;">${elem[2]}</h5>
                    <p class="desc">${elem[3]}</p>
                    <div class="box">
                        <span class="price" data-id="${elem[0]}">¥&nbsp;${elem[4]}</span>
                        <span class="btn-buy"></span>
                    </div>
                </div>
            </a>
        </li>
        `
    }
})();