(() => {
  new Vue({
    el: ".grid-wrapper",
    data: {
      item: [
        [9012154, "甜美公主", "368", "甜美公主-白玫瑰22枝，粉佳人粉玫瑰14枝，粉色桔梗5枝", "甜美设计 清新典雅"],
        [9012243, "恋恋情深", "198", "恋恋情深-11枝香槟玫瑰，白色多头百合2枝", "经典款式 简约设计"],
        [9010969, "你最珍贵", "248", "你最珍贵-精品玫瑰礼盒:香槟玫瑰19枝，勿忘我适量", "优雅设计 精致甄选"],
        [9012441, " 语笑嫣然", "198", " 语笑嫣然-粉佳人玫瑰9枝、粉色小菊、洋桔梗、尤加利叶", "温柔相伴，笑容常在"],
        [9012011, "阳光海岸", "228", "阳光海岸-19枝香槟玫瑰", "98%好评率，热销推荐"],
        [9012149, "99的爱", "639", "99的爱-香槟玫瑰99枝，尤加利15枝", ""],
        [9012223, "我只钟情你", "236", "/我只钟情你-香槟玫瑰11枝、白色小雏菊3枝", "错落有致 甜蜜纯洁"],
        [9012345, "甜蜜相伴", "162", "甜蜜相伴-粉佳人玫瑰9枝，白色洋桔梗0.2扎", "创意包装 高端大气"],
        [9012219, "天秤座守护花", "298", "天秤座守护花-香槟玫瑰11枝、多头白百合3枝、蕾丝3枝、银叶菊8枝", "天秤座鲜花定制款"],
        [9012437, "粉雪佳人", "219", "粉雪佳人-戴安娜粉玫瑰11枝、白色香水百合2枝、白色洋桔梗5枝", "清新典雅，至臻设计"],
        [9012072, "向日葵之歌", "189", "向日葵之歌-向日葵6枝", "心向暖阳，快乐相伴"],
        [9012446, "满天星-浅粉", "189", "满天星-浅粉-满天星1扎", "满天星辰，只因有你"],
        [9092116, "恋恋情深＋心相印蛋糕", "329", "恋恋情深＋心相印蛋糕-11枝香槟玫瑰，白色多头百合2枝", "一见倾心，心向往之"],
        [9010890, "致青春/无声的爱", "229", "致青春/无声的爱-满天星一大扎", ""],
        [9012043, "夏之物语", "442", "夏之物语-香槟玫瑰50枝", ""],
        [9012447, "满天星-浅紫", "198", "满天星-浅紫-满天星1扎", "满天星辰，只因有你"],
        [9012056, "香妃", "132", "香妃-香槟玫瑰9枝", "清新脱俗"],
        [9012290, "好幸运", "490", "好幸运-粉佳人玫瑰13枝，苏醒玫瑰16枝，粉色扶朗5枝，灯台9枝，尤加利叶", "精品鲜花"],
        [9010904, "青青子衿", "280", "青青子衿-白色多头香水百合6枝", "香味清新 风格独特"],
        [9012038, "依靠", "155", "依靠-戴安娜粉玫瑰12枝，紫色桔梗5枝，粉色勿忘我3枝", "浪漫配色 美好寓意"],
        [9012045, "心花怒放", "198", "心花怒放-粉香水百合5枝", ""],
        [9012141, "柔情似水", "158", "柔情似水-香槟色玫瑰11枝，紫红色勿忘我0.3扎", "柔情似水，佳期如梦"],
        [9012411, "十全十美", "349", "十全十美-香槟玫瑰10枝，橙康乃馨10枝，红色洋牡丹10枝", "春季新品"],
        [9012242, "柔情蜜意", "206", "柔情蜜意-11枝戴安娜粉玫瑰，多头白百合2枝", ""],
        [9020012, "水果花篮-欣情", "348", "水果花篮-欣情-百合、红掌、玫瑰、扶郎、康乃馨等花材；进口橙子、红富士苹果、红提、哈密瓜等新鲜水果", ""],
        [9012039, "如初", "205", "如初-19枝白玫瑰，紫色勿忘我5枝", "特惠款"],
        [9012033, "为爱相随", "179", "为爱相随-多头百合1枝，戴安娜粉玫瑰11枝", "你若不离，我必不弃"],
        [9012369, "如沐春风/自然风抱桶花", "179", "如沐春风/自然风抱桶花-粉佳人玫瑰11枝", "清新风格 暖春最佳"]
      ]
    }
  });
})();
(() => {
  new Vue({
    el: ".panel",
    data: {
      item: [
        [9010734, "清风雅韵", "清风雅韵-香槟玫瑰12枝，迷你菊6枝", "169"],
        [9010904, "青青子衿", "青青子衿-白色多头香水百合6枝", "280"],
        [9012045, "心花怒放", "心花怒放-粉香水百合5枝", "198"],
        [9010890, "致青春/无声的爱", "致青春/无声的爱-满天星一大扎", "229"],
        [9010815, "好心情", "好心情-红色太阳花10枝，香槟玫瑰5枝，香槟色桔梗3枝，水仙百合5枝", "182"]
      ]
    }
  })
})();
(() => {
  new Vue({
    el: ".wrapper :last-child :last-child .panel-body",
    data: {
      com: [
        [9012009, "313889*", "还行。很满意"],
        [9010966, "hua_133*", "按时送到老人特高兴 其次客服婷婷服务特别周到，耐心谢谢"],
        [9012223, "136****3714", "很不错，喜欢"],
        [9010969, "wxmp_hl*", "女朋友很喜歡呢"],
        [9010011, "159****1663", "客服、服务都可以"],
        [9012033, "309679*", "花很新鲜、漂亮，朋友很喜欢，派送时间很准"]
      ]
    }
  });
})();
(() => {
  new Vue({
    el: ".knowledge",
    data: {
      one: [
        ["/huayu/11995.html", "象征友谊的花是什么？什么鲜花代表友情？？"],
        ["/huayu/12237.html", "好朋友间送什么花？"],
        ["/huayu/11610.html", "送异性朋友什么花最合适？"],
        ["/huayu/11174.html", "女同学过生日送什么好？"],
        ["/huayu/10475.html", "给朋友送花，就要“投其所好”"]
      ],
      two: [
        ["/huayu/10505.html", "温暖推荐：送给朋友的鲜花"],
        ["/huayu/20051116174222.htm", "经典送花祝福语"],
        ["/huayu/20050612082846.htm", "用鲜花表达情感-谈送花礼仪"],
        ["/huayu/20050611130752.htm", "不同场合送什么花？"],
        ["/huayu/20050611130659.htm", " 鲜花与星座"]
      ],
      three: [
        ["/huayu/10472.html", "送朋友什么花好？"],
        ["/huayu/20050611130941.htm", "鲜花与节日"],
        ["/huayu/20050611131024.htm", " 鲜花与生日"],
        ["/huayu/20050612080530.htm", "婚礼用鲜花大全"],
        ["/huayu/20050405004253.htm", "女孩都喜欢别人送鲜花吗？"]
      ]
    }
  })
})();























